/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   banner.h                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mwelfrin <mwelfrin@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/24 16:50:27 by ibour             #+#    #+#             */
/*   Updated: 2025/04/19 12:39:50 by ibour            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef BANNER_H

# define BANNER_H

# define COLOR_ORANGE "\001\033[38;5;214m\002"
# define COLOR_GREEN "\001\033[38;5;120m\002"
# define COLOR_YELLOW "\001\033[38;5;228m\002"
# define COLOR_BLUE "\001\033[38;5;81m\002"
# define COLOR_MAGENTA "\001\033[38;5;177m\002"
# define COLOR_CYAN "\001\033[38;5;51m\002"
# define COLOR_PINK "\001\033[38;5;218m\002"
# define COLOR_RESET "\001\033[0m\002"
# define COLOR_RED "\001\033[38;5;210m\002"

# define BANNER_LINE1 "　　　　 🌸＞　　フ"
# define BANNER_LINE2 "　　　　 | 　_　 _"
# define BANNER_LINE3 "　 　　 ／` ミ_wノ\t\t                        ▲    ▲"

# define BANNER_LINE4_P1 "　　　 /　　　  |\t ▗▄▄▖▗▖ ▗▖▗▄▄▖ ▗▄▄▄▖▗▄▄▖  ▗▖  ▗▖"
# define BANNER_LINE4_P2 "▗▖  ▗▖▗▄▖🌸 ▗▄▄▖▗▖ ▗▖▗▄▄▄▖▗▖  ▗▖"

# define BANNER_LINE5_P1 "　　 /　 ヽ　　 ﾉ\t▐▌   ▐▌ ▐▌▐▌ ▐▌▐▌   ▐▌ ▐▌ ▐▛▚▖▐▌"
# define BANNER_LINE5_P2 " ▝▚▞▘▐▌ ▐▌ ▐▌   ▐▌ ▐▌▐▌   ▐▌  ▐▌"

# define BANNER_LINE6_P1 " 　 │　　|　|　|\t ▝▀▚▖▐▌ ▐▌▐▛▀▘ ▐▛▀▀▘▐▛▀▚▖ ▐▌ ▝▜▌"
# define BANNER_LINE6_P2 "  ▐▌ ▐▛▀▜▌  ▝▀▚▖▐▛▀▜▌▐▛▀▀▘▐▌  ▐▌"

# define BANNER_LINE7_P1 "／￣|　　 |　|　|\t▗▄▄▞▘▝▚▄▞▘▐▌   ▐▙▄▄▖▐▌ ▐▌ ▐▌"
# define BANNER_LINE7_P2 "  ▐▌  ▐▌ ▐▌ ▐▌ ▗▄▄▞▘▐▌ ▐▌▐▙▄▄▖▐▙▄▄▐▙▄▄▖"

# define BANNER_LINE8 "| (￣ヽ＿_ヽ_)__)"
# define BANNER_LINE9 "＼二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二二つ"

#endif
